In [2]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('exemplo',sep=',')

In [8]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
 df = df + 1

In [10]:
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [13]:
df.to_csv("exemplo.csv",sep=';',decimal=',')

In [19]:
df = pd.read_excel('Exemplo_Excel.xlsx',sheetname='Sheet1')

In [20]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [23]:
df.to_excel("exemplo_Excel.xlsx",sheet_name='sheet2')

In [38]:
df = pd.read_html('https://pt.wikipedia.org/wiki/Lista_das_maiores_empresas_do_mundo')

In [39]:
type(df)

list

In [40]:
len(df)

5

In [48]:
df[4]

                         0                       1
0                   Região              Ativos [8]
1                    China  US$ 24,145,000,000,000
2  Norte e Oeste da Europa  US$ 21,700,000,000,000
3         América do Norte  US$ 16,619,000,000,000
4                    Japão  US$ 11,783,000,000,000
5              Reino Unido   US$ 7,740,000,000,000
6    Sul e Leste da Europa   US$ 6,394,034,000,000
7                  Oceania   US$ 4,000,000,000,000
8            Coreia do Sul   US$ 2,384,951,000,000
9           América Latina   US$ 1,900,000,000,000